package homeWork;

public class Task4 {
    public static void main(String[] args) {/*
    Необходимо вывести числа от 0 до 15.
     */
        int[] a = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 15};

        for(int i = 0; i < a.length; i++){
            System.out.println(a[i]);

        }

        /*
        Задача №2
       Необходимо возводить в степень число 5 начиная с показателя 1,
       пока результат возведения в степень меньше 10000, вывести результат каждого
       возведения в степень.
         */


    }

}
